---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.RibbonButton
source: html/1d664192-a151-d1df-d9f3-8b53535703ea.htm
---
# RibbonButton Members

Determines whether the specified Object is equal to the current Object .